import re

def idcard():
    
    
    ID=input('请输入十八位身份证号码:')
    if len(ID)==18:
        print("你的身份证号码是 "+ID)
    else:
            print("错误的身份证号码")

    ID_area=ID[0:2]
    ID_birth=ID[6:14]
    ID_sex=ID[14:17]
    ID_check=ID[17]

    w=[7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2]
    ID_CHECK=['1','0','X','9','8','7','6','5','4','3','2']
    ID_sum=0
    for i in range(0,17):
        ID_sum=ID_sum+int(ID[i])*w[i]
    ID_Check=ID_sum%11
    if ID_check==w[ID_Check]:
        print('正确的身份证号码')
    else:
           print('错误的身份证号码')
 
    ID_Area = { "11":"北京","12":"天津","13":"河北","14":"山西","15":"内蒙古","21":"辽宁","22":"吉林","23":"黑龙江",
    "31":"上海","32":"江苏","33":"浙江","34":"安徽","35":"福建","36":"江西","37":"山东","41":"河南","42":"湖北",
    "43":"湖南","44":"广东","45":"广西","46":"海南","50":"重庆","51":"四川","52":"贵州","53":"云南","54":"西藏",
    "61":"陕西","62":"甘肃","63":"青海","64":"宁夏","65":"新疆","71":"台湾","81":"香港","82":"澳门","91":"国外"}

    if ID_area in ID_Area.keys():
        print("该身份证所属地区为 "+ID_Area[ID_area])

    year=ID_birth[0:4]
    moon=ID_birth[4:6]
    day=ID_birth[6:8]
    print("生日: "+year+'年'+moon+'月'+day+'日')

    if int(ID_sex)%2==0:
        print('性别：女')
    else:
            print('性别：男')






